cf/BusinessProcesses/ЗадачаРазработчику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<BusinessProcess>
		<Properties>
			<Name>ЗадачаРазработчику</Name>
			<Task>Task.ЗадачаПользователю</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВажностиЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадачиразработчикам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контроллер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланируемаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Часов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаЗаЧас</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролерПринимаетЗадачу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОповещатьПоПочте</Name>
					<Comment>служебное поле, типа дополнительных свойств но изза особенностей веб клиента вынесено в объект</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оплачена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсторияИзменений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Задача</Name>
							<Type>
								<v8:Type>cfg:TaskRef.ЗадачаПользователю</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеДо</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеПосле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

cf/BusinessProcesses/ЗадачаРазработчику/Ext/ManagerModule.bsl
Функция ПолучитьТекстHTMLОВыполнении_ст(Ссылка) Экспорт
	
	// Возвращает текст html с комментариями по выполнению
	//
	// Ссылка - ссылка на бизнес процесс
	
	Текст = 
	"<HTML><HEAD>
	|<META content=""text/html; charset=utf-8"" http-equiv=Content-Type>
	|<META name=GENERATOR content=""MSHTML 8.00.7600.16588""></HEAD>
	|<body bgcolor=""#FCFAEB"">";
	
	Запрос = Новый Запрос("
	//|ВЫБРАТЬ
	//|	Задача,
	//|	ИмяРеквизита,
	//|	Дата 					КАК Дата,
	//|	ПредставлениеДо 		КАК ПредставлениеДо,
	//|	ПредставлениеПосле 	КАК ПредставлениеПосле,
	//|	МАКСИМУМ(Автор) 				КАК Автор,
	//|	МАКСИМУМ(ТочкаМаршрута) 		КАК ТочкаМаршрута,
	//|	МАКСИМУМ(ДатаЗадачи) 			КАК ДатаЗадачи
	//|ИЗ
	//|(
	|	ВЫБРАТЬ 
	|		История.Задача,
	|		История.ИмяРеквизита,
	|		История.Дата,
	|		История.ПредставлениеДо,
	|		История.ПредставлениеПосле,
	|		История.Автор,
	|		NULL КАК ТочкаМаршрута,
	|		NULL КАК ДатаЗадачи
	|	ИЗ 
	|		БизнесПроцесс.ЗадачаРазработчику.ИсторияИзменений КАК История
	|	ГДЕ 
	|		Ссылка = &Ссылка
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ 
	|		Ссылка,
	|		NULL, NULL, NULL, NULL, 
	|		Пользователь, 
	|		ТочкаМаршрута,
	|		Дата КАК ДатаЗадачи
	|	ИЗ
	|		Задача.ЗадачаПользователю 
	|	ГДЕ
	|		БизнесПроцесс = &Ссылка И ПометкаУдаления = Ложь
	|
	//|)	КАК Запрос
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Задача,
	//|	ИмяРеквизита,
	//|	Дата
	|
	|УПОРЯДОЧИТЬ ПО 
	|	Задача, Дата
	|
	|ИТОГИ 
	|	Максимум(Автор), Максимум(ДатаЗадачи), Максимум(ТочкаМаршрута)
	|ПО
	|	Дата, Задача
	|
	|");
	
	//Запрос = Новый Запрос("
	//|ВЫБРАТЬ 
	//|	ЕСТЬNULL(История.Задача, текЗадачи.текЗадача) КАК Задача,
	//|	История.ИмяРеквизита,
	//|	История.Дата,
	//|	История.ПредставлениеДо,
	//|	История.ПредставлениеПосле,
	//|	История.Автор,
	//|	текЗадачи.ТочкаМаршрута,
	//|	текЗадачи.ДатаЗадачи
	//|
	//|ИЗ 
	//|	БизнесПроцесс.ЗадачаРазработчику.ИсторияИзменений КАК История
	//|
	//|ПОЛНОЕ СОЕДИНЕНИЕ
	//|	(	
	//|		ВЫБРАТЬ Ссылка КАК текЗадача, ТочкаМаршрута, дата КАК ДатаЗадачи
	//|		ИЗ 		Задача.ЗадачаПользователю 
	//|		ГДЕ 	БизнесПроцесс = &Ссылка И ПометкаУдаления = Ложь
	//|
	//|	) КАК текЗадачи
	//|ПО
	//|	текЗадачи.текЗадача = ЕСТЬNULL(История.Задача, текЗадачи.текЗадача)
	//|
	//|ГДЕ 
	//|	Ссылка = &Ссылка
	//|
	//|УПОРЯДОЧИТЬ ПО 
	//|	Задача, Дата
	//|
	//|ИТОГИ 
	//|	Максимум(Автор), Максимум(ДатаЗадачи), Максимум(ТочкаМаршрута)
	//|ПО
	//|	Задача, Дата
	//|
	//|");
	
	ТекстМелкийВыделенныйШрифтНачало = "<font class=""Apple-style-span"" color=""#808080""><b><span class=""Apple-style-span"" style=""font-size: x-small;"">";
	ТекстМелкийВыделенныйШрифтКонец = "</span></b></font>";
	
	ТекстМелкийВыделенныйсотрудникНачало 	= "<font class=""Apple-style-span"" color=""#0000FF""><b><span class=""Apple-style-span"" style=""font-size: x-small;"">";
	ТекстМелкийВыделенныйсотрудникКонец 	= "</span></b></font>";
	
	ТекстМелкийШрифтНачало = "<font class=""Apple-style-span"" color=""#808080""><i><span class=""Apple-style-span"" style=""font-size: x-small;"">";
	ТекстМелкийШрифтКонец = "</span></i></font>";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	ВыборкаЗадач = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	Пока ВыборкаЗадач.Следующий() Цикл
		
		// Добавим выполнение задачи
		
		естьЗадача = Не ВыборкаЗадач.Задача.Пустая();
		
		Если естьЗадача Тогда
			
			Текст = Текст + "
				|<hr>
				|<p>" + ТекстМелкийВыделенныйШрифтНачало + Формат(ВыборкаЗадач.ДатаЗадачи,"ДЛФ=DDT") + " назначено " + ТекстМелкийВыделенныйсотрудникНачало + КэшируемыеФункции.ПолучитьСокращеноеПредставлениеПользователя(ВыборкаЗадач.Автор) + ТекстМелкийВыделенныйсотрудникКонец + " " + ВыборкаЗадач.ТочкаМаршрута + ТекстМелкийВыделенныйШрифтКонец + "</p>
				|<blockquote>";
			
		КонецЕсли;
		
		// Добавим текст изменений
		
		ВыборкаДат = ВыборкаЗадач.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		Пока ВыборкаДат.Следующий() Цикл
			
			Если ЗначениеЗаполнено(ВыборкаДат.Дата) Тогда
			
				Текст 				= Текст + "
										|<p>" + ТекстМелкийШрифтНачало + Формат(ВыборкаДат.Дата,"ДЛФ=DDT") + "  " + КэшируемыеФункции.ПолучитьСокращеноеПредставлениеПользователя(ВыборкаДат.Автор) + ТекстМелкийШрифтКонец + "</p>";
				ТекстКомментария 	= "";
				
				ВыборкаРеквизитов = ВыборкаДат.Выбрать();
				Пока ВыборкаРеквизитов.Следующий() Цикл
					
					// комментарий выделем особо
					
					Если ВыборкаРеквизитов.ИмяРеквизита = "Комментарий" Тогда
						
						ТекстКомментария = ВыборкаРеквизитов.ПредставлениеПосле;
						
					Иначе
						
						Текст = Текст + "
						|<p><font class=""Apple-style-span"" color=""#339966"">" + ВыборкаРеквизитов.ИмяРеквизита + " изменил </font> с " + ВыборкаРеквизитов.ПредставлениеДо + " на " + ВыборкаРеквизитов.ПредставлениеПосле + "</p>";
						
					КонецЕсли;
					
				КонецЦикла;
				
				// добавим комментарий
				
				Если не ПустаяСтрока(ТекстКомментария) Тогда
					Текст = Текст + "
							|<p>" + ТекстКомментария + "</p>";
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		// закроем блок
		
		Если естьЗадача Тогда
			
			Текст = Текст + "
						|</blockquote>
						|</hr>";
		КонецЕсли;
	КонецЦикла;
	
	// если решена тода скажем
	
	Если Ссылка.Завершен Тогда
		
		Текст = Текст + "
		|<hr><p><font class=""Apple-style-span"" color=""#D80000""><b><span class=""Apple-style-span"">Бизнес процесс завершен " + Формат(Ссылка.ДатаЗавершения,"ДЛФ=DDT") + "</span></b></font></p></hr>";
		
	КонецЕсли;
	
	Возврат Текст + "
	|</body></HTML>";
	
	//Если Выполнение.Пустой() Тогда
	//	Возврат "";
	//КонецЕсли;
	//
	//Выборка = Выполнение.Выбрать();
	//
	//КолЗаписей 	= Выборка.Количество();
	//Ном 		= 0;
	//Пустой 		= Истина;
	//
	//Пока Выборка.Следующий() Цикл Ном = Ном + 1;
	//	
	//	Если пустаяСтрока(Выборка.Комментарий) Тогда
	//		КолЗаписей = КолЗаписей - 1;
	//		Продолжить;
	//	КонецЕсли;
	//	
	//	Если Ном = КолЗаписей Тогда
	//		
	//		ОбзацНачало = "<P><STRONG>";
	//		ОбзацКонец = "</STRONG></P>";
	//		
	//	Иначе
	//		
	//		ОбзацНачало = "<P>";
	//		ОбзацКонец = "</P>";
	//		
	//	КонецЕсли;
	//	
	//	Пустой = Ложь;
	//	
	//	Текст = Текст +
	//	
	//	"<font class=""Apple-style-span"" color=""#808080""><i><span class=""Apple-style-span"" style=""font-size: x-small;"">"
	//	+ Формат(Выборка.ДатаВыполнения,"ДЛФ=DT") + 
	//	"</span></i></font><i><span class=""Apple-style-span"" style=""font-size: x-small;"">"
	//	+ " " + Лев(Выборка.Исполнитель, Найти(Выборка.Исполнитель," ")) +
	//	"<font class=""Apple-style-span"" color=""#CC99FF"">"
	//	+ " (" + Выборка.наименование + ")" + 
	//	"</font></span></i></p>
	//	
	//	|" + ОбзацНачало + Выборка.Комментарий + ОбзацКонец;
	//	
	//КонецЦикла;
	//
	//Возврат ?(Пустой, "", Текст);
	
КонецФункции
Функция ПолучитьТекстHTMLОВыполнении_Ст2(Ссылка) Экспорт
	
	// Возвращает текст html с комментариями по выполнению
	//
	// Ссылка - ссылка на бизнес процесс
	
	Текст = 
	"<HTML><HEAD>
	|<META content=""text/html; charset=utf-8"" http-equiv=Content-Type>
	|<META name=GENERATOR content=""MSHTML 8.00.7600.16588""></HEAD>
	|<body bgcolor=""#FCFAEB"">";
	
	Запрос = Новый Запрос("
	|	ВЫБРАТЬ 
	|		История.Задача,
	|		История.ИмяРеквизита,
	|		История.Дата,
	|		История.ПредставлениеДо,
	|		История.ПредставлениеПосле,
	|		История.Автор,
	|		NULL КАК ТочкаМаршрута,
	|		NULL КАК ДатаЗадачи
	|	ИЗ 
	|		БизнесПроцесс.ЗадачаРазработчику.ИсторияИзменений КАК История
	|	ГДЕ 
	|		Ссылка = &Ссылка
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ 
	|		Ссылка,
	|		NULL, NULL, NULL, NULL, 
	|		Пользователь, 
	|		ТочкаМаршрута,
	|		Дата КАК ДатаЗадачи
	|	ИЗ
	|		Задача.ЗадачаПользователю 
	|	ГДЕ
	|		БизнесПроцесс = &Ссылка И ПометкаУдаления = Ложь
	|
	|УПОРЯДОЧИТЬ ПО 
	|	Дата
	|
	|ИТОГИ 
	|	Максимум(Задача), Максимум(Автор), Максимум(ДатаЗадачи), Максимум(ТочкаМаршрута)
	|ПО
	|	Дата
	|
	|");
	
	ТекстМелкийВыделенныйШрифтНачало = "<font class=""Apple-style-span"" color=""#808080""><b><span class=""Apple-style-span"" style=""font-size: x-small;"">";
	ТекстМелкийВыделенныйШрифтКонец = "</span></b></font>";
	
	ТекстМелкийВыделенныйсотрудникНачало 	= "<font class=""Apple-style-span"" color=""#0000FF""><b><span class=""Apple-style-span"" style=""font-size: x-small;"">";
	ТекстМелкийВыделенныйсотрудникКонец 	= "</span></b></font>";
	
	ТекстМелкийШрифтНачало = "<font class=""Apple-style-span"" color=""#808080""><i><span class=""Apple-style-span"" style=""font-size: x-small;"">";
	ТекстМелкийШрифтКонец = "</span></i></font>";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	стЗадача = Неопределено;
	
	ВыборкаДат = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	Пока ВыборкаДат.Следующий() Цикл
		
		// Добавим выполнение задачи
		
		//естьЗадача = Не ВыборкаЗадач.Задача.Пустая();
		//
		//Если естьЗадача Тогда
		//	
		//	Текст = Текст + "
		//		|<hr>
		//		|<p>" + ТекстМелкийВыделенныйШрифтНачало + Формат(ВыборкаЗадач.ДатаЗадачи,"ДЛФ=DDT") + " назначено " + ТекстМелкийВыделенныйсотрудникНачало + КэшируемыеФункции.ПолучитьСокращеноеПредставлениеПользователя(ВыборкаЗадач.Автор) + ТекстМелкийВыделенныйсотрудникКонец + " " + ВыборкаЗадач.ТочкаМаршрута + ТекстМелкийВыделенныйШрифтКонец + "</p>
		//		|<blockquote>";
		//	
		//КонецЕсли;
		
		// Добавим текст изменений
		
		//ВыборкаДат = ВыборкаЗадач.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		//Пока ВыборкаДат.Следующий() Цикл
		
		ЗакрытьБлокЗадач = Ложь;
		
		Если стЗадача <> ВыборкаДат.Задача Тогда
			
			стЗадача = ВыборкаДат.Задача;
			ЗакрытьБлокЗадач = Истина;
			
			Текст = Текст + "
				|<hr></hr>
				|<p>" + ТекстМелкийВыделенныйШрифтНачало + Формат(ВыборкаДат.ДатаЗадачи,"ДЛФ=DDT") + " назначено " + ТекстМелкийВыделенныйсотрудникНачало + КэшируемыеФункции.ПолучитьСокращеноеПредставлениеПользователя(ВыборкаДат.Автор) + ТекстМелкийВыделенныйсотрудникКонец + " " + ВыборкаДат.ТочкаМаршрута + ТекстМелкийВыделенныйШрифтКонец + "</p>
				|<blockquote>";
			
		КонецЕсли;
		
		
		Если ЗначениеЗаполнено(ВыборкаДат.Дата) Тогда
		
			Текст 				= Текст + "
									|<p>" + ТекстМелкийШрифтНачало + Формат(ВыборкаДат.Дата,"ДЛФ=DDT") + "  " + КэшируемыеФункции.ПолучитьСокращеноеПредставлениеПользователя(ВыборкаДат.Автор) + ТекстМелкийШрифтКонец + "</p>";
			ТекстКомментария 	= "";
			
			ВыборкаРеквизитов = ВыборкаДат.Выбрать();
			Пока ВыборкаРеквизитов.Следующий() Цикл
				
				// комментарий выделем особо
				
				Если ВыборкаРеквизитов.ИмяРеквизита = "Комментарий" Тогда
					
					ТекстКомментария = ВыборкаРеквизитов.ПредставлениеПосле;
					
				Иначе
					
					Текст = Текст + "
					|<p><font class=""Apple-style-span"" color=""#339966"">" + ВыборкаРеквизитов.ИмяРеквизита + " изменил </font> с " + ВыборкаРеквизитов.ПредставлениеДо + " на " + ВыборкаРеквизитов.ПредставлениеПосле + "</p>";
					
				КонецЕсли;
				
			КонецЦикла;
			
			// добавим комментарий
			
			Если не ПустаяСтрока(ТекстКомментария) Тогда
				Текст = Текст + "
						|<p>" + ТекстКомментария + "</p>";
			КонецЕсли;
		КонецЕсли;
		
		// закроем блок
		
		Если ЗакрытьБлокЗадач Тогда
			
			Текст = Текст + "
						|</blockquote>
						//|</hr>
						|";
		КонецЕсли;
	КонецЦикла;
	
	// если решена тода скажем
	
	Если Ссылка.Завершен Тогда
		
		Текст = Текст + "
		|<hr><p><font class=""Apple-style-span"" color=""#D80000""><b><span class=""Apple-style-span"">Бизнес процесс завершен " + Формат(Ссылка.ДатаЗавершения,"ДЛФ=DDT") + "</span></b></font></p></hr>";
		
	КонецЕсли;
	
	Возврат Текст + "
	|</body></HTML>";
	
	//Если Выполнение.Пустой() Тогда
	//	Возврат "";
	//КонецЕсли;
	//
	//Выборка = Выполнение.Выбрать();
	//
	//КолЗаписей 	= Выборка.Количество();
	//Ном 		= 0;
	//Пустой 		= Истина;
	//
	//Пока Выборка.Следующий() Цикл Ном = Ном + 1;
	//	
	//	Если пустаяСтрока(Выборка.Комментарий) Тогда
	//		КолЗаписей = КолЗаписей - 1;
	//		Продолжить;
	//	КонецЕсли;
	//	
	//	Если Ном = КолЗаписей Тогда
	//		
	//		ОбзацНачало = "<P><STRONG>";
	//		ОбзацКонец = "</STRONG></P>";
	//		
	//	Иначе
	//		
	//		ОбзацНачало = "<P>";
	//		ОбзацКонец = "</P>";
	//		
	//	КонецЕсли;
	//	
	//	Пустой = Ложь;
	//	
	//	Текст = Текст +
	//	
	//	"<font class=""Apple-style-span"" color=""#808080""><i><span class=""Apple-style-span"" style=""font-size: x-small;"">"
	//	+ Формат(Выборка.ДатаВыполнения,"ДЛФ=DT") + 
	//	"</span></i></font><i><span class=""Apple-style-span"" style=""font-size: x-small;"">"
	//	+ " " + Лев(Выборка.Исполнитель, Найти(Выборка.Исполнитель," ")) +
	//	"<font class=""Apple-style-span"" color=""#CC99FF"">"
	//	+ " (" + Выборка.наименование + ")" + 
	//	"</font></span></i></p>
	//	
	//	|" + ОбзацНачало + Выборка.Комментарий + ОбзацКонец;
	//	
	//КонецЦикла;
	//
	//Возврат ?(Пустой, "", Текст);
	
КонецФункции
Функция ПолучитьТекстHTMLОВыполнении_Ст3(Ссылка) Экспорт
	
	// Возвращает текст html с комментариями по выполнению
	//
	// Ссылка - ссылка на бизнес процесс
	
	Текст = 
	"<HTML><HEAD>
	|<META content=""text/html; charset=utf-8"" http-equiv=Content-Type>
	|<META name=GENERATOR content=""MSHTML 8.00.7600.16588""></HEAD>
	|<body bgcolor=""#FCFAEB"">";
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ 
	|	ЕСТЬNULL(История.Задача, текЗадачи.текЗадача) КАК Задача,
	|	История.ИмяРеквизита,
	|	ЕСТЬNULL(История.Дата, текЗадачи.ДатаЗадачи) КАК Дата,
	|	История.ПредставлениеДо,
	|	История.ПредставлениеПосле,
	|	ЕСТЬNULL(История.Автор, текЗадачи.Пользователь) КАК Автор,
	|	текЗадачи.Пользователь КАК НазначенаЗадача,
	|	текЗадачи.ТочкаМаршрута,
	|	текЗадачи.ДатаЗадачи
	|
	|ИЗ 
	|	БизнесПроцесс.ЗадачаРазработчику.ИсторияИзменений КАК История
	|
	|ПОЛНОЕ СОЕДИНЕНИЕ
	|	(	
	|		ВЫБРАТЬ Ссылка КАК текЗадача, ТочкаМаршрута, дата КАК ДатаЗадачи, Пользователь
	|		ИЗ 		Задача.ЗадачаПользователю 
	|		ГДЕ 	БизнесПроцесс = &Ссылка И ПометкаУдаления = Ложь
	|
	|	) КАК текЗадачи
	|ПО
	|	текЗадачи.текЗадача = ЕСТЬNULL(История.Задача, текЗадачи.текЗадача)
	|
	|ГДЕ 
	|	ЕСТЬNULL(Ссылка,&Ссылка) = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО 
	|	Дата
	|
	|ИТОГИ 
	|	Максимум(Задача),Максимум(Автор), Максимум(НазначенаЗадача), Максимум(ДатаЗадачи), Максимум(ТочкаМаршрута)
	|ПО
	|	Дата
	|
	|");
	
	ТекстМелкийВыделенныйШрифтНачало = "<font class=""Apple-style-span"" color=""#808080""><b><span class=""Apple-style-span"" style=""font-size: x-small;"">";
	ТекстМелкийВыделенныйШрифтКонец = "</span></b></font>";
	
	ТекстМелкийВыделенныйсотрудникНачало 	= "<font class=""Apple-style-span"" color=""#0000FF""><b><span class=""Apple-style-span"" style=""font-size: x-small;"">";
	ТекстМелкийВыделенныйсотрудникКонец 	= "</span></b></font>";
	
	ТекстМелкийШрифтНачало = "<font class=""Apple-style-span"" color=""#808080""><i><span class=""Apple-style-span"" style=""font-size: x-small;"">";
	ТекстМелкийШрифтКонец = "</span></i></font>";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	стЗадача = Неопределено;
	
	ВыборкаДат = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	Пока ВыборкаДат.Следующий() Цикл
		
		ЗакрытьБлокЗадач = Ложь;
		
		Если стЗадача <> ВыборкаДат.Задача Тогда
			
			стЗадача = ВыборкаДат.Задача;
			
			если ЗначениеЗаполнено(стЗадача) Тогда
			
				ЗакрытьБлокЗадач = Истина;
				
				Текст = Текст + "
					|<hr></hr>
					|<p>" + ТекстМелкийВыделенныйШрифтНачало + Формат(ВыборкаДат.ДатаЗадачи,"ДЛФ=DDT") + " назначено " + ТекстМелкийВыделенныйсотрудникНачало + КэшируемыеФункции.ПолучитьСокращеноеПредставлениеПользователя(ВыборкаДат.НазначенаЗадача) + ТекстМелкийВыделенныйсотрудникКонец + " """ + ВыборкаДат.ТочкаМаршрута + """" + ТекстМелкийВыделенныйШрифтКонец + "</p>
					|<blockquote>";
					
			КонецЕсли;
		КонецЕсли;
		
		
		Если ЗначениеЗаполнено(ВыборкаДат.Дата) Тогда
			
			ТекстПользовательНачалоДействий = "<p>" + ТекстМелкийШрифтНачало + Формат(ВыборкаДат.Дата,"ДЛФ=DDT") + "  " + КэшируемыеФункции.ПолучитьСокращеноеПредставлениеПользователя(ВыборкаДат.Автор) + ТекстМелкийШрифтКонец + "</p>";
			НачалоДействийДобавлено = Ложь;
			
			//Текст 				= Текст + 
			ТекстКомментария 	= "";
			
			ВыборкаРеквизитов = ВыборкаДат.Выбрать();
			Пока ВыборкаРеквизитов.Следующий() Цикл
				
				// комментарий выделем особо
				
				Если ВыборкаРеквизитов.ИмяРеквизита = "Комментарий" Тогда
					
					Если Не НачалоДействийДобавлено Тогда
						НачалоДействийДобавлено = Истина;
						Текст = Текст + ТекстПользовательНачалоДействий;
					КонецЕсли;
					
					ТекстКомментария = ВыборкаРеквизитов.ПредставлениеПосле;
					
				ИначеЕсли Не ПустаяСтрока(ВыборкаРеквизитов.ИмяРеквизита) Тогда
					
					Если Не НачалоДействийДобавлено Тогда
						НачалоДействийДобавлено = Истина;
						Текст = Текст + ТекстПользовательНачалоДействий;
					КонецЕсли;
					
					Текст = Текст + "
					|<font class=""Apple-style-span"" color=""#339966"">" + ВыборкаРеквизитов.ИмяРеквизита + " изменил </font> с " + ВыборкаРеквизитов.ПредставлениеДо + " на " + ВыборкаРеквизитов.ПредставлениеПосле + "</br>";
					
				КонецЕсли;
				
			КонецЦикла;
			
			// добавим комментарий
			
			Если не ПустаяСтрока(ТекстКомментария) Тогда
				
				Если Не НачалоДействийДобавлено Тогда
					НачалоДействийДобавлено = Истина;
					Текст = Текст + ТекстПользовательНачалоДействий;
				КонецЕсли;
				
				Текст = Текст + "
						|<p>" + ТекстКомментария + "</p>";
			КонецЕсли;
		КонецЕсли;
		
		// закроем блок
		
		Если ЗакрытьБлокЗадач Тогда
			
			Текст = Текст + "
						|</blockquote>
						|";
		КонецЕсли;
	КонецЦикла;
	
	// если решена тода скажем
	
	Если Ссылка.Завершен Тогда
		
		Текст = Текст + "
		|<hr><p><font class=""Apple-style-span"" color=""#D80000""><b><span class=""Apple-style-span"">Бизнес процесс завершен " + Формат(Ссылка.ДатаЗавершения,"ДЛФ=DDT") + "</span></b></font></p></hr>";
		
	КонецЕсли;
	
	Возврат Текст + "
	|</body></HTML>";
	
КонецФункции
Функция ПолучитьТекстHTMLОВыполнении(Ссылка) Экспорт
	
	// Возвращает текст html с комментариями по выполнению
	//
	// Ссылка - ссылка на бизнес процесс
	
	Текст = 
	"<HTML><HEAD>
	|<META content=""text/html; charset=utf-8"" http-equiv=Content-Type>
	|<META name=GENERATOR content=""MSHTML 8.00.7600.16588""></HEAD>
	|<body bgcolor=""#FCFAEB"">";
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ 
	|	ЕСТЬNULL(История.Задача, текЗадачи.текЗадача) КАК Задача,
	|	История.ИмяРеквизита,
	|	ЕСТЬNULL(История.Дата, текЗадачи.ДатаЗадачи) КАК Дата,
	|	История.ПредставлениеДо,
	|	История.ПредставлениеПосле,
	|	ЕСТЬNULL(История.Автор, текЗадачи.Пользователь) КАК Автор,
	|	текЗадачи.Пользователь КАК НазначенаЗадача,
	|	текЗадачи.ТочкаМаршрута,
	|	текЗадачи.ДатаЗадачи
	|
	|ИЗ 
	|	БизнесПроцесс.ЗадачаРазработчику.ИсторияИзменений КАК История
	|
	|ПОЛНОЕ СОЕДИНЕНИЕ
	|	(	
	|		ВЫБРАТЬ Ссылка КАК текЗадача, ТочкаМаршрута, дата КАК ДатаЗадачи, Пользователь
	|		ИЗ 		Задача.ЗадачаПользователю 
	|		ГДЕ 	БизнесПроцесс = &Ссылка И ПометкаУдаления = Ложь
	|
	|	) КАК текЗадачи
	|ПО
	|	текЗадачи.текЗадача = ЕСТЬNULL(История.Задача, текЗадачи.текЗадача)
	|
	|ГДЕ 
	|	ЕСТЬNULL(Ссылка,&Ссылка) = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО 
	|	Дата, Задача
	|");
	
	ТекстМелкийВыделенныйШрифтНачало = "<font class=""Apple-style-span"" color=""#808080""><b><span class=""Apple-style-span"" style=""font-size: x-small;"">";
	ТекстМелкийВыделенныйШрифтКонец = "</span></b></font>";
	
	ТекстМелкийВыделенныйсотрудникНачало 	= "<font class=""Apple-style-span"" color=""#0000FF""><b><span class=""Apple-style-span"" style=""font-size: x-small;"">";
	ТекстМелкийВыделенныйсотрудникКонец 	= "</span></b></font>";
	
	ТекстМелкийШрифтНачало = "<font class=""Apple-style-span"" color=""#808080""><i><span class=""Apple-style-span"" style=""font-size: x-small;"">";
	ТекстМелкийШрифтКонец = "</span></i></font>";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	стЗадача 				= Неопределено;
	стДата 					= '00010101';
	НачалоДействийДобавлено = Ложь;
	ЗакрытьБлокЗадач 		= Ложь;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ЗакрытьБлокЗадач = Ложь;
		
		Если стЗадача <> Выборка.Задача Тогда
			
			стЗадача = Выборка.Задача;
			
			если ЗначениеЗаполнено(стЗадача) Тогда
			
				ЗакрытьБлокЗадач = Истина;
				
				Текст = Текст + "
					|<hr></hr>
					|<p>" + ТекстМелкийВыделенныйШрифтНачало + Формат(Выборка.ДатаЗадачи,"ДЛФ=DDT") + " назначено " + ТекстМелкийВыделенныйсотрудникНачало + КэшируемыеФункции.ПолучитьСокращеноеПредставлениеПользователя(Выборка.НазначенаЗадача) + ТекстМелкийВыделенныйсотрудникКонец + " """ + Выборка.ТочкаМаршрута + """" + ТекстМелкийВыделенныйШрифтКонец + "</p>
					|<blockquote>";
					
			КонецЕсли;
		КонецЕсли;
		
		
		Если ЗначениеЗаполнено(Выборка.Дата) Тогда
			
			Если стДата <> Выборка.Дата Тогда
				стДата = Выборка.Дата;
				ТекстПользовательНачалоДействий = "<p>" + ТекстМелкийШрифтНачало + Формат(Выборка.Дата,"ДЛФ=DDT") + "  " + КэшируемыеФункции.ПолучитьСокращеноеПредставлениеПользователя(Выборка.Автор) + ТекстМелкийШрифтКонец + "</p>";
				НачалоДействийДобавлено = Ложь;
			КонецЕсли;
			
			//Текст 				= Текст + 
			ТекстКомментария 	= "";
			
			//ВыборкаРеквизитов = ВыборкаДат.Выбрать();
			//Пока ВыборкаРеквизитов.Следующий() Цикл
				
				// комментарий выделем особо
				
			Если Выборка.ИмяРеквизита = "Комментарий" Тогда
					
				Если Не НачалоДействийДобавлено Тогда
					НачалоДействийДобавлено = Истина;
					Текст = Текст + ТекстПользовательНачалоДействий;
				КонецЕсли;
					
				//ТекстКомментария = ПреобразоватьПутиВложений(Выборка.ПредставлениеПосле);
				ТекстКомментария = Выборка.ПредставлениеПосле;
					
			ИначеЕсли Не ПустаяСтрока(Выборка.ИмяРеквизита) Тогда
					
				Если Не НачалоДействийДобавлено Тогда
					НачалоДействийДобавлено = Истина;
					Текст = Текст + ТекстПользовательНачалоДействий;
				КонецЕсли;
					
				Текст = Текст + "
				|<font class=""Apple-style-span"" color=""#339966"">" + Выборка.ИмяРеквизита + " изменил </font> с " + Выборка.ПредставлениеДо + " на " + Выборка.ПредставлениеПосле + "</br>";
					
			КонецЕсли;
				
			//КонецЦикла;
			
			// добавим комментарий
			
			Если не ПустаяСтрока(ТекстКомментария) Тогда
				
				Если Не НачалоДействийДобавлено Тогда
					НачалоДействийДобавлено = Истина;
					Текст = Текст + ТекстПользовательНачалоДействий;
				КонецЕсли;
				
				Текст = Текст + "
						|<p>" + ТекстКомментария + "</p>";
			КонецЕсли;
		КонецЕсли;
		
		// закроем блок
		
		Если ЗакрытьБлокЗадач Тогда
			
			Текст = Текст + "
						|</blockquote>
						|";
		КонецЕсли;
	КонецЦикла;
	
	// если решена тода скажем
	
	Если Ссылка.Завершен Тогда
		
		Текст = Текст + "
		|<hr><p><font class=""Apple-style-span"" color=""#D80000""><b><span class=""Apple-style-span"">Бизнес процесс завершен " + Формат(Ссылка.ДатаЗавершения,"ДЛФ=DDT") + "</span></b></font></p></hr>";
		
	КонецЕсли;
	
	Возврат Текст + "
	|</body></HTML>";
	
КонецФункции

Функция ПреобразоватьПутиВложений(Текст)
	
	//РазбТекст = СтрЗаменить(Текст,Символы.ПС, "<<%ПС%>>");
	//РазбТекст = СтрЗаменить(РазбТекст,"<img src='", Символы.ПС);
	//
	//числоСтрок 	= СтрЧислоСтрок(РазбТекст);
	//новТекст 	= "";
	//
	//Для Ном = 1 По числоСтрок Цикл
	//	
	//	новТекст = новТекст + СтрЗаменить();
	//	
	//КонецЦикла;
	//
	
	
КонецФункции

Функция ЗаписатьСтатусПроцесса(СсылкаПроцесса) Экспорт
	
	// Запишем статус процесса
	
	//ТекЗадача = ФункцииБизнесПроцессов.ТекущаяЗадача(СсылкаПроцесса);
	//
	//Если СсылкаПроцесса.Завершен Тогда
	//	Статус = "Завершен";
	//ИначеЕсли Не СсылкаПроцесса.Стартован Тогда
	//	Статус = "Черновик";
	//ИначеЕсли ЗначениеЗаполнено(ТекЗадача) Тогда
	//	Статус = ТекЗадача;
	//Иначе
	//	Статус = "Не известный";
	//КонецЕсли;
	//	
	//Запись = РегистрыСведений.СтатусыБП.СоздатьМенеджерЗаписи();
	//Запись.Статус 			= Статус;
	//Запись.БизнесПроцесс 	= СсылкаПроцесса;
	//	
	//Попытка
	//	Запись.Записать();
	//Исключение
	//	ОбщиеФункции.СообщитьТекст(ОписаниеОшибки());
	//	Возврат Ложь;
	//КонецПопытки;
	//
	Возврат Истина;
	
КонецФункции
